{
  "body": "We’re Future Inventions ([Lex](https://lexfefegha.com/), [Uzoma](https://uzomaorji.com/) and [Yaa](https://yaa-addae.net/)), a collective and grassroots community tech school dedicated to ***expanding our collective technological imagination*** towards new ways of understanding + creating technologies ***through an afrocentric lens***. We do this via design workshops, study groups, and facilitating guest sessions with artist-technologists. Currently, Yaa and Lex are in London and Uzoma is in Abuja, Nigeria and so we hold parallel in-person sessions in both places, as well as virtual events to tap into a global network of people who are invested in more hopeful technological futures.\n\nWe at Future Inventions:\n\n* Educate ourselves on how power shapes the way technologies are developed and distributed \n* disrupt the binary between user and creator by engaging in collective research and ideation\n* refuse the logic of technosolutionism by recognizing that the innovation necessary for change is not confined to ‘tools’ or ‘products’\n* harness ancestral knowledge and non-western lineages of science in our practice\n* value technology that affirms all sentient life, not just that of humans* \n* call in futures which are yet to happen but must*\n\n\\* in line with:\n\n1-Afrotectopia’s definition of technology  as an extension of sentient capability.\n\n2- Tina Campt’s grammar of Black Futurity\n\nThe team:\n\n### Lex Fefegha\n\nFrom experimental games and digital playgrounds to chatbots and art installations, my work invites everyone to explore alternative realities, learn through play, and experience new perspectives and emotions. Currently exploring new realms of interactive play powered by AI with [Google Arts & Culture Lab](https://artsandculture.google.com/play).  \n\nFormer associate lecturer [UAL's Creative Computing Institute](https://www.arts.ac.uk/creative-computing-institute) & [Central Saint Martins](https://www.arts.ac.uk/colleges/central-saint-martins) on [computational futures, AI](https://github.com/lexfefegha/Computational-Futures-And-AI) and [narrative environments](https://www.narrative-environments.com/). Former co-founder of [COMUZI](https://www.comuzi.xyz/).\n\n[WEBSITE](https://lexfefegha.com/)[](https://lexfefegha.com/)[](https://lexfefegha.com/)\n\n### Uzoma Orji\n\nAs an artist and dreamer, my work imagines a progressive African future in which the people are truly free. As a technologist, I research and prototype tech for the 21st century that derives from ancient African technological modalities. My philosophy as a futurist draws from the wisdom of the Sankofa bird and acknowledges that the secrets to a prosperous future lie in our past. I am the director of the Ministry of Dreams, a speculative government agency dedicated to safeguarding collective imagination, the creative director of [uzoma.studio](https://uzoma.studio/), a creative technology studio for artists and creative brands\n\n[WEBSITE](https://uzomaorji.com/about)[](https://uzomaorji.com/about)[](https://uzomaorji.com/about)\n\n### Yaa Addae\n\nI’m an art writer, tech researcher, and participatory curator who is committed to harnessing design for healing structural wounds. Outside of Future Inventions, I run Open Heart Clinic, an ongoing research project and programming series investigating systemic barriers to a more loving world and envisioning future care infrastructure. I’ve worked at many places and done many things from gallery operations to trends forecasting. Currently, alongside my cultural work, I work at the NHS as a design researcher. \n\n[WEBSITE](https://yaa-addae.net/)\n\n[](https://yaa-addae.net/)\n\n[](https://yaa-addae.net/)\n\n#### Contact\n\nFor questions, collaboration requests or suggestions, please email us at [futureinventions.lab@gmail.com](mailto:futureinventions.lab@gmail.com)\n\n[INSTAGRAM](https://www.instagram.com/futureinventions.lab/)\n\n[ARE.NA](https://www.are.na/future-inventions/channels)\n\n[MAILING LIST](https://future-inventions.us16.list-manage.com/subscribe?u=4b38eb6681f8e1cfa44c76f88&id=089a73a1a2)",
  "title": "About Future Inventions",
  "thumbnail": "/images/uploads/groupteamphoto.png"
}
