{
  "body": "**[Future Inventions: Ancestral Technologies](https://www.eventbrite.co.uk/e/ancestral-technologies-panel-design-workshop-virtual-tickets-1242190528309?aff=oddtdtcreator)**\n\nJoin us for an evening of conversation and collective imagination exploring the theme of Ancestral Technologies. In recent years, there’s been a push to remember and conceptualize non-western lineages of science& technology. Terms such as ancestral technology, indigenous technology and [Lo-TEK ](https://www.taschen.com/en/books/architecture-design/04698/julia-watson-lo-tek-design-by-radical-indigenism/)are increasingly common with artists, technologists, and theorists actively producing work to expand the history of technological advancement and highlight what culturally-informed innovation looks like today.\n\nIt’s only fitting that we look back to move forward and so we are hosting this session to generate discussion around what exactly is an ancestral technology and what this means in practice.\n\n\n\n\n**How is this going to go?**\n\nWe’ll begin by hearing from Zoë Chinonso Ene (An African Design Canon) , Banji Chona (Inkaya Studio/ Zambezi Radical Archives), and The Ezeks Twins (Sanctuaries of Nature) who will share 10 minute presentations on their practice as it relates to ancestral technologies. This will be followed by a Q&A and a short break before a speculative design activity informed by our learnings. All of this will be explained further on the day.\n\n**No pre-reading or preparation necessary!** If you are curious, we have collated these resources to allow people learn more beforehand:[ Ancestral Technology Resource List](https://docs.google.com/document/d/e/2PACX-1vStHGcLkUdlkGBuCJV0cp5WXFWC8eGyQhhNb8x9-zXas4Ke4HNz5Rf9dtdywDeEsyTZ3AHFbujkEGPy/pub)\n\n\n\n\n\n\n\n**Guest Speakers:**\n\n[Zoë Chinonso Ene](https://www.zoeene.design/) (An African Design Canon)\n\nZoë Chinonso Ene is a PhD candidate in Design and Applied Arts at the Royal College of Art and an experience designer at Microsoft. She is also the founder of[ An African Design Canon](https://www.instagram.com/an.african.design.canon/): an annotated visual repository documenting design choices seen in historical African everyday things before they were labeled art or artifact, and [Homenka](https://homenka.com/aadc?fbclid=PAZXh0bgNhZW0CMTEAAaYF1N2YuOTVV_yYptfS70KXwbqbxYmh3qVK_3UY1g-ChCSUPm1Op4gt8Kc_aem_9VXfcECG70zx_AM_AcfvAQ): a design studio & research collective exploring an approach for creating and co-creating new objects and experiences that honor the traditional past by synthesizing with the present to tangibly continue culture in the Nigerian context.\n\n\n\n\n[Banji Chona](https://www.instagram.com/p/C3s1nQIIHqQ/?hl=en&img_index=1) (Inkaya Studio/ Zambezi Radical Archives)\n\nBanji Chona is a Scholar of Zambezian Earth. Focusing on critical explorations of identity, memory, resistance and the communion of community through storytelling and healing, her work is rooted in the methodology of Radical Zambezian Reimagination. This is an offering of alternative historiographies and presentisms positioned to challenge socio-political and environmental fractures. By using \"Zambezia\" instead of \"Zambia,\" she imagines an ancestral land beyond colonial projections and spatialities, fostering connections and healing beyond the imagined nation-state of Zambia. Chona has exhibited in both solo and group shows in Zambia, Italy, Norway, Germany, South Africa and Senegal. Her work and practice have been documented in the art journal Contemporary&. She is the recipient of the 2024 Prince Claus Seed Award and is a fellow on the LoCA 2024 Curatorial Studio Programme in Livingstone, Zambia.\n\n\n\n\n[The Ezeks Twins ](https://www.instagram.com/ezekstwins/)(Sanctuaries of Nature)\n\nChine and Chuba Ezekwesili are Abuja-based multidisciplinary artists, designers, and co-founders of [Akanka Studio](https://akanka.com/?utm_campaign=linkinbio&utm_medium=referral&utm_source=later-linkinbio): an innovation studio designing a more sustainable world with nature, and [Sanctuaries of Nature](https://www.instagram.com/sanctuariesofnature/): a platform for creating ecologically-friendly spaces for intentional living and learning. Their design philosophy stems from the philosophy of nature – a collection of lessons on designing life.Using this framework, they partner with corporates, founders and investors to transform impactful ideas into sustainable ventures.",
  "title": "Ancestral Technologies: Panel & Workshop",
  "date": "2025-02-19T13:59:00.000+00:00",
  "thumbnail": "/images/uploads/ancestraltechnologiespanelvirtual.jpg",
  "venue": "Virtual"
}
