{
  "title": "Futuring Towards Freedom: Panel, Virtual",
  "date": "2025-04-30T06:38:00.000+01:00",
  "thumbnail": "/images/uploads/futuringtowardsfreedomvirtual.jpg",
  "body": "**[Future Inventions: Futuring Towards Freedom Panel](https://www.eventbrite.co.uk/e/futuring-towards-freedom-panel-virtual-tickets-1316271356059?aff=oddtdtcreator)**\n\nJoin us for the final offering in our Winter/Spring Programming, a virtual panel exploring the theme of Futuring Towards Freedom.\n\n“The role of the artist is exactly the same as the role of the lover. If I love you, I have to make you conscious of the things you don't see.” James Baldwin.\n\n\nIt’s clear that the circumstances of our current moment need to change - all life (‘human’ and ‘non-human’) needs to be respected, resources need to be shared, love needs to be given the necessary space to nurture new systems new systems of being in relation to one another. But what exactly do these better futures look like? and what will we do once we get there?\n\nAs much as tangible action is necessary, so too is a clear vision of the reality we are working towards and so join us for a panel exploring the role of artistic speculation and world-building(/bending/*mending)* in developing more hopeful technological futures.\n\nCome, let’s sharpen our imagination together!\n\n\n**How is this going to go?**\n\nWe’ll begin by hearing from Ari Melenciano (Afrotectopia) , Natalie Paneng, and Noah Misan Okwudini who will share 15 minute presentations on their practice as it relates to Futures. This will be followed by a Q&A. All of this will be explained further on the day.\n\n\n\n\n**Bios:**\n\n**Noah Misan Okwudini**\n\nNoah Misan Okwudini is an antidisciplinary artist, writer, and futures synthesist. He believes in the power of community and the potential to dream and co-create desirable futures and participatory realities. His inquiry process employs research, art thinking, and pedagogical approaches to document, conceptualize and speculate, including work with archives, using formats like photography, sound, performance, and new media. He often works at the intersection of art, science, and technology, viewing this as a site for prototyping and imagining alternative realities. He explores eco-cultural narratives, memory, space-time, and how African culture changes within these shifts. Noah was part of the inaugural cohort of Dreaming New Worlds by the Goethe Institut. With his collective Ala Praxis, he was a recipient of the pilot S+T+ARTS4Africa residency grant. He also co-founded Kuota Spacetime, an initiative creating space for communities to dream and shape participatory realities and alternate futures.\n\n\n\n\n**Natalie Paneng**\n\nNatalie Paneng is a Johannesburg-based transmedia artist and digital worldbuilder crafting surreal narratives through installation, performance, and creative technology. A BA Honours graduate in Dramatic Arts from Wits University, she blends theatre and self-taught digital wizardry to explore the role of the alternative Black woman in shifting realities. Her work has shown internationally at venues like Galerie Eigen + Art, Stevenson Gallery, Kunsthalle Bremen, and more. She has presented at HKW and festivals including MUTEK Montreal and IDFA, where Natalie’s Trifecta won the 2023 Special Jury Prize for Creative Technology. A recent resident at Studio Quantum and Gasworks London (2024), she continues to explore the entangled realms of science, art, and spirit.\n\n\n\n\n**Ari Melenciano**\n\nAri Melenciano has cultivated an expansive practice within the arts, technology, design, culture, and pedagogy. Her cultivated ability to combine many disciplines reveals their interconnectedness and reimagines their conventions for new possibilities. Her art practice ranges from using improvisational dance as an ethnomusicological research instrument, to exploring AI through both critical and imaginative lenses, to sonic composition using botanical data. Her work has been exhibited around the world from Dubai's Museum of the Future to the Studio Museum in Harlem. She's a frequent international public speaker, and occasionally designs and teaches courses at New York University, Hunter College, Parsons, and the Pratt Institute.\n\nShe's the founder of [Afrotectopia](https://www.afrotectopia.org/), a social institution that imagines new possibilities at the nexus of art, design, technology, and culture. Afrotectopia has taken many forms including festivals, think tanks, summer camp, adult continued education programming, international residency, and incubators. Currently, Afrotectopia is on a book tour to promote their recently published kitchen table art book titled, Black Metal, which came out of an incubator between Afrotectopia, MIT Media Lab's Space Exploration Initiative, and NYU's Interactive Telecommunications Program. And previously, she was a creative technologist at Google's Creative Lab. Some work she did while at Google included creating technologies using machine learning on hardware devices the size of a finger, contributing creative direction for the Google for Africa campaign, and creative strategy for generative AI development.\n\n\\---------\n\nIf you are curious, we have collated these resources to allow people learn more about the topic beforehand:[ ](https://docs.google.com/document/d/e/2PACX-1vStHGcLkUdlkGBuCJV0cp5WXFWC8eGyQhhNb8x9-zXas4Ke4HNz5Rf9dtdywDeEsyTZ3AHFbujkEGPy/pub)[Futuring Towards Freedom Resource List](https://docs.google.com/document/d/e/2PACX-1vRFxfx0qBdMZC8_2X2_zAOtRydPCP1yfAEfC3dIfbI7YW6NWzS9dnogXlUKHmaMYH170x2PWHBH3Cac/pub) and our open-source/ongoing [Are.na research thread](https://www.are.na/decolonize-the-art-world/future-inventions-futuring-towards-freedom)\n\nPlease reach out to us via email at futureinventionslab@gmail.com or DM @futureinventions.lab on instagram with any questions.",
  "venue": "Virtual"
}
