{
  "title": "Futures 101: Designing Our Tech Futures",
  "date": "2025-04-16T06:37:00.000+01:00",
  "thumbnail": "/images/uploads/designingourtechfutureslondon.jpg",
  "body": "**[Future Inventions: Designing Our Tech Futures](https://www.eventbrite.co.uk/e/futures-101-designing-our-tech-futureslondon-tickets-1316164095239?aff=oddtdtcreator)**\n\nJoin us for the final offering in our in-person Winter/Spring Programming, a workshop exploring the theme of Futuring Towards Freedom. We know that this current moment feels particularly bleak - AI ripping off livelihoods and reinforcing bias, innovation being used to aid genocide in Gaza and as an excuse for pillaging Congo, Big Tech getting more powerful and insular, and people being more digitally connected than ever before but feeling increasingly socially isolated. It's disheartening! And still, there is tangible work happening in the present that inspires hope, action, and the belief that another future is both possible and already here.\n\nThe practice of futures/ forecasting has primarily been used in political and commercial domains, for governments and companies to ensure they stay afloat no matter what. In this session, we aim to leverage these methodologies (as well as the skills of creative futurists such as Octavia Butler) to strategise how we might reinforce current realities that point to more hopeful technological futures and strengthen our abilities to name + describe change. In short, we’re going to practice telling the future.\n\n**How is this going to go?**\n\nWe’ll begin with a brief overview of the theme and move into a collective reading of[ A Few Rules for Predicting the Future](https://antiableistcomposition.com/wp-content/uploads/2020/07/octavia_e._butler_a_few_rules_.pdf) by Octavia Butler, followed by a workshop activity where we'll practice introductory forecasting skills such as identifying signals, drivers , and creating scenarios based on present-day developments. Pariticpants will be assigned to small groups where they will collectively choose to either write or sketch an artefact of a hopeful technological future. All of this will be explained further on the day. There will be clear worksheets, prompts and printed images/visual artefacts to support the process.\n\n**No pre-reading or preparation necessary!** If you are curious, we have collated these resources: https://www.are.na/decolonize-the-art-world/future-inventions-futuring-towards-freedom\n\n**If you would like to learn more beforehand, here's a few stand-outs**\n\n**EXPLORE:**\n\n* [Making Room](https://www.makingroom.online/)\n* [Black Metal](https://www.afrotectopia.org/)\n* [Black Quantum Futurism](https://www.blackquantumfuturism.com/about)\n\n**READ:**\n\n* [A Few Rules for Predicting the Future](https://antiableistcomposition.com/wp-content/uploads/2020/07/octavia_e._butler_a_few_rules_.pdf) by Octavia Butler\n* [The Mundane Afrofuturist Manifesto](https://rhizome.org/editorial/2013/dec/17/mundane-afrofuturist-manifesto/) by Martine Syms\n* [Neema Githere: The artist exploring Afropresentism and the digital diaspora](https://wepresent.wetransfer.com/stories/neema-githere-selected-by-olafur-eliasson) by Ravi Ghosh\n* [Future Oriented Design](https://medium.com/thoughts-and-reflections/future-oriented-design-c8b4a458a722) by Lex Fefegha\n\n**WATCH:**\n\n* [Mining The Future](https://www.youtube.com/watch?v=0GQATxGM9I4) by Ruby Justice Thelot\n\n**LISTEN:**\n\n* Podcast Episode:[ Breaking Free of Fate](https://www.futurepod.org/podcast/ep-165) with Alex Quicho - Spotify (and on several other platforms)\n* [Carceral Fictions and Abolitionist Realities](https://open.spotify.com/show/1pIPChfm74JwORJhYnIvpL)\n\nPlease reach out to us via email at futureinventionslab@gmail.com or DM @futureinventions.lab on instagram with any questions.\n\nThere will be soft drinks and pizza but please feel free to bring your own dinner, there is microwave to warm up food and fridge for storage.\n\nHeader Image: Notes to self by Octavia Butler (Collage) sourced via Jasmine Butler ( https://in.pinterest.com/pin/39336196740429630/ )",
  "venue": "ustwo, London"
}
