{
  "title": "The Experimental Web: Alternative Visions of the Internet, London",
  "thumbnail": "/images/uploads/theexperimentalweblondon.jpg",
  "body": "**[Future Inventions: The Experimental Web](https://www.eventbrite.co.uk/e/1271686381199?aff=oddtdtcreator)**\n\nJoin us for the third offering in our Winter/Spring Programming, a study group exploring the theme of The Experimental Web: Alternative Visions of the Internet.\n\nThe world wide web was once believed to the world’s solution to creating a global village, promising to connect millions across time and place and exist as a vast directory of knowledge. Yet today’s reality looks nothing like this with social networks being the dominant pathways into the internet. Long gone are the days of random discovery and ‘surfing the web’ - instead, our realities online are largely directed by SEO and algorithms. As of 2022, More than half of all network traffic [(57%) ](https://www.techmonitor.ai/hardware/networks/big-tech-accounts-for-over-half-of-global-internet-traffic)was attributable to Google, Netflix, Facebook, Apple, Amazon, and Microsoft. What does it mean that our digital roads mostly drive through these Big Tech giants? How does the design of the internet reflect the values and logics of capitalist / colonial actors?\n\nIn response to this, web designers, artists, and organisations are increasingly experimenting with creating ‘the small web’ (other terms include ‘the tiny internet’, ‘handmade web’, and ‘slow web’), which described an internet outside of Big Tech Social Media, often designed to encourage curiosity and exploration and reflect the niche interests of the creator(s).\n\nThis month, we will be focusing on the history of the internet from its military roots to public development, the infrastructure that supports it, and the social/artistic interventions that are reimagining what the web could look like.\n\n**How is this going to go?**\n\nWe’ll begin with an overview of the theme by delivering a brief and engaging introductory lecture on the history of the internet, network infrastructure and artistic interventions in making the web a safer and more interesting place to be. From here, we will collectively read the essay [On Digital Gardens: Tending to Our Collective Multiplicity by Annika Izora ](https://www.deemjournal.com/stories/digital-gardens)and then break out into smaller groups for guided discussion around our relationship to the internet and how we might reimagine it to better meet our needs/the needs of our communities. After small group discussion, there will be a larger share-out around our learnings and we will close. All of this will be explained further on the day.\n\n**No pre-reading or preparation necessary!** If you are curious, we have collated these resources: https://www.are.na/decolonize-the-art-world/future-inventions-the-experimental-web\n\n**If you would like to learn more beforehand, here's a few stand-outs**\n\n**EXPLORE:**\n\n* [Garden Garden Garden](https://gardengarden.garden/?utm_source=pocket_saves)\n* [The Tiny Awards : Celebrating the personal internet](https://tinyawards.net/)\n* [Becoming Infrastructure](https://aliceyuanzhang.com/becoming-infrastructure.html)\n* [As Above/ So Below ](https://unseen-guests.net/commissions/yaa/yaa_left.html)\\[Enable pop-ups]\n* [Web Design As Architecture](https://www--arc.com/)\n* [External Pages](https://externalpages.org/) Virtual Gallery\n* [Internet Tour](https://internetour.com/)\n\n**READ:**\n\n* [Why the Internet isn't fun anymore](https://www.newyorker.com/culture/infinite-scroll/why-the-internet-isnt-fun-anymore) - Kyle Chayka\n* [The Internet is Afropolitan](https://thisisafrica.me/politics-and-society/the-internet-is-afropolitan/) - Achille Mbembe\n* [Making Space for A Handmade Web](https://www.figma.com/blog/making-space-for-a-handmade-web/) - Chia Amisola\n* [My Website is a shifting house next to a river of knowledge. What could yours be?](https://thecreativeindependent.com/essays/laurel-schwulst-my-website-is-a-shifting-house-next-to-a-river-of-knowledge-what-could-yours-be/) - Laurel Schwulst\n* [Finding Cntrl: Visions for the Future Internet](https://findingctrl.nesta.org.uk/)\n* [A field guide to the living internet](https://findingctrl.nesta.org.uk/field-guide-to-the-living-internet/) - Udit Vara\n\n**WATCH:**\n\n* [Screen Walk with Chia Amisola](https://www.youtube.com/watch?v=faGcK-FGHSI)\n* [Deep Down Tidal ](https://www.youtube.com/watch?v=V9EIywuH-LM)by Tabita Rezaire\n* [A Journey To the Bottom of the Internet](https://www.youtube.com/watch?v=H9R4tznCNB0)\n\n\n\nPlease reach out to us via email at futureinventionslab@gmail.com or DM @futureinventions.lab on instagram with any questions.\n\nThere will be soft drinks and pizza but please feel free to bring your own dinner, there is microwave to warm up food and fridge for storage.\n\n\nHeader Image: Stefan Rotter / Getty",
  "venue": "ustwo, London",
  "date": "2025-03-19T06:24:00.000+00:00"
}
